// 机场任务状态
export const flighttask_step_code = {
    '0': '作业准备中',
    '1': '飞行作业中',
    '2': '作业后状态恢复',
    '3': '自定义飞行区更新中',
    '4': '地形障碍物更新中',
    '5': '任务空闲',
    '255': '飞行器异常',
    '256': '未知状态',
}

// 飞行器状态
export const drone_status = {
    0: '待机',
    1: '起飞准备',
    2: '起飞准备完毕',
    3: '手动飞行',
    4: '自动起飞',
    5: '航线飞行',
    6: '全景拍照',
    7: '智能跟随',
    8: 'ADS-B 躲避',
    9: '自动返航',
    10: '自动降落',
    11: '强制降落',
    12: '三桨叶降落',
    13: '升级中',
    14: '未连接',
    15: 'APAS',
    16: '虚拟摇杆状态',
    17: '指令飞行',
    18: '空中 RTK 收敛模式',
    19: '机场选址中',
}

// 机舱空调状态
export const airConditionerState = {
    0: '空闲模式',
    1: '制冷模式',
    2: '制热模式',
    3: '除湿模式',
    4: '制冷退出模式',
    5: '制热退出模式',
    6: '除湿退出模式',
    7: '制冷准备模式',
    8: '制热准备模式',
    9: '除湿准备模式',
    10: '风冷准备中',
    11: '风冷中',
    12: '风冷退出中',
    13: '除雾准备中',
    14: '除雾中',
    15: '除雾退出中',
}

// 航线状态码
export const execute_status = {
    canceled: '取消或终止',
    failed: '失败',
    in_progress: '执行中',
    ok: '执行成功',
    partially_done: '部分完成',
    paused: '暂停',
    rejected: '拒绝',
    sent: '已下发',
    timeout: '超时',
}
